sisanwu12/STM32F429IGT6-Embedfire-Template/mcu/drivers/dri_i2c2.h
#pragma once

#include "stm32f4xx_hal.h"

#ifdef __cplusplus
extern "C" {
#endif

/*
 * drivers/ 层：I2C2（片上外设）驱动
 *
 * 说明：
 * - 只封装 I2C 外设能力（init + mem read/write + ready）
 * - 具体引脚映射由 board/ 层的 HAL_I2C_MspInit 负责
 */

HAL_StatusTypeDef dri_i2c2_init(void);
I2C_HandleTypeDef *dri_i2c2_handle(void);

HAL_StatusTypeDef dri_i2c2_mem_read(uint16_t dev_addr_7bit, uint16_t mem_addr,
                                    uint16_t mem_addr_size, uint8_t *data,
                                    uint16_t len, uint32_t timeout_ms);
HAL_StatusTypeDef dri_i2c2_mem_write(uint16_t dev_addr_7bit, uint16_t mem_addr,
                                     uint16_t mem_addr_size,
                                     const uint8_t *data, uint16_t len,
                                     uint32_t timeout_ms);
HAL_StatusTypeDef dri_i2c2_is_device_ready(uint16_t dev_addr_7bit,
                                          uint32_t trials,
                                          uint32_t timeout_ms);

HAL_StatusTypeDef dri_i2c2_write_read(uint16_t dev_addr_7bit,
                                     const uint8_t *wbuf, uint16_t wlen,
                                     uint8_t *rbuf, uint16_t rlen,
                                     uint32_t timeout_ms);
HAL_StatusTypeDef dri_i2c2_write(uint16_t dev_addr_7bit, const uint8_t *wbuf,
                                uint16_t wlen, uint32_t timeout_ms);

#ifdef __cplusplus
} /*extern "C"*/
#endif
